export const scenes = [
  // 🧠 STORY 01: ไม่มีรูป
  {
    id: "story_1",
    type: "story",
    image: "/images/story_1.png",
    content: `
ท่ามกลางความเงียบงันและไอเย็น
คุณลืมตาขึ้น... บนพื้นหญ้าเปียกชื้น
รอบตัวถูกกลืนด้วยหมอกหนา
ข้างกายมีเพียงจดหมายเก่าเล่มหนึ่ง
เปิดออก… พบกระดาษแผ่นเดียว
มีเพียงข้อความว่า`,
  },

  // 🧠 STORY 02: มี title
  {
    id: "story_2",
    type: "story",
    title: "“จงปล่อยวาง แล้วใช้หัวใจนำทาง”",
    content: `
หลังจากอ่านข้อความจบ  
เสียงเพลงแผ่วเบาลอยมาตามสายลม  
คุณจึงตัดสินใจลุกขึ้น... เดินตามเสียงนั้นไป`,
  },

  //Quiz_1
  {
    id: "quiz_1",
    type: "quiz",
    title: `
ลมหายใจเริ่มถี่... หนัก
ความเย็นเกาะแน่นในอก
แต่ละก้าวที่เดิน... ใจเริ่มตั้งคำถามกับตัวเอง
“ปลายทางอยู่ที่ไหน ?”`,
    content: "หากก้าวออกจากหมอกนี้ได้... ใจคุณอยากเจออะไรเป็นอย่างแรก?",
    choices: [
      { id: "3bb6648a-8540-4394-85a8-a1dd778a69e8", text: "ที่ว่างให้ตัวเองได้พัก... หายใจอย่างอิสระ" },
      { id: "a0ab8568-6c6f-4bf7-856c-a5fdf82022a1", text: "สัมผัสอบอุ่นจากธรรมชาติ ที่โอบกอดใจ" },
      { id: "639d3b4b-0528-4938-8cfb-3bdf26b0c8dd", text: "สิ่งใหม่ ๆ ที่ทำให้หัวใจตื่นอีกครั้ง" },
      { id: "44f5b23d-8c94-401e-bff6-56e1f766167f", text: "แววตาที่บอกว่า...เธอไม่ได้อยู่คนเดียว" },
    ],
  },

  //Quiz_2
  {
    id: "quiz_2",
    type: "quiz",
    content: `ถ้าเดินไปต่อ จะอยาก 
  “เจอใคร” หรือ “ไม่เจอใคร”`,
    choices: [
      { id: "d7627218-c258-46c6-9faa-8dd58272fa58", text: "ไม่อยากเจอใครเลย ขอเดินคนเดียว" },
      { id: "10e9d10a-08e4-49cc-a80b-0102baa67ec4", text: "อยากเจอคนที่คุ้นเคย เข้าใจกัน" },
      { id: "848e8070-0f92-4761-a1a4-daa776dd141e", text: "อยากเจอคนใหม่ ๆ ที่จะเปิดมุมมองให้เรา" },
      { id: "e4d89642-6dac-4c00-ab32-2d55a5859b4c", text: "อยากเจอสิ่งมีชีวิตที่ให้ความรู้สึกอบอุ่น" },
    ],
  },

  //Quiz_3
  {
    id: "quiz_3",
    type: "quiz",
    content: `คุณเห็นบางอย่างในพุ่มไม้ข้างทาง
  อะไร…ทำให้คุณหยุด?`,
    choices: [
      { id: "f6518886-9c12-4a2f-9455-cc5aa32bc0ae", text: "เข็มกลัดโลหะรูปวงกลม ดีไซน์เรียบเท่" },
      { id: "fde92aae-4070-4819-96aa-2afd4eed50d3", text: "กล่องไม้เล็ก ๆ ภายในเต็มไปด้วยดอกไม้" },
      { id: "8ba5a459-eed7-4a09-a0a7-556ad89ec5e9", text: "โพลารอยด์ภาพใครบางคนยิ้มให้กล้อง" },
      { id: "fd7a5beb-8232-4d55-a610-d11000db5129", text: "ตลับสีเก่าที่มีเฉดประหลาด และคราบนิ้วมือเปื้อนสี" },
    ],
  },

  // 🧠 STORY 03:
  {
    id: "story_3",
    type: "story",
    image: "/images/story_3.png",
    content: `
ระหว่างเดินทางตามเสียงนั้น
เห็นเงาบ้างอย่าง จึงก้าวเข้าไปใกล้
สิ่งที่เห็น... คือ “กระต่ายสีขาวตัวน้อย”
ที่นอนแน่นิ่งบนพื้นหญ้า
ขนเปียกชื้น ดวงตาหลับสนิท
ดูเหมือนมันได้รับบาดเจ็บ`,
  },
  
  //Quiz_4
  {
    id: "quiz_4",
    type: "quiz",
    content: `คุณจะทำอย่างไร? กับกระต่ายตัวนั้น`,
    choices: [
      { id: "d19e297c-6cfc-418e-8e93-0e91f5109bc3", text: "นั่งลงเงียบ ๆ ข้าง ๆ ไม่พูดอะไร ปล่อยให้มันพัก" },
      { id: "07f478be-1174-4443-8d4e-17026d5643fa", text: "อุ้มมันอย่างเบามือ ห่อผ้าตัวเองแล้วลูบหัวเบา ๆ" },
      { id: "5e6da85a-a3cf-477c-9778-3e874d85e5e1", text: "กวาดตามองรอบ ๆ หาสมุนไพรหรือสิ่งที่ช่วยได้" },
      { id: "98ad7841-2664-4b54-9e9f-eec53c47c804", text: "ยืนนิ่งแล้วคิดว่า…นี่มันหมายถึงอะไร?" },
    ],
  },

  // 🧠 STORY 04
  {
    id: "story_4",
    type: "story",
    title: "“หื้มมมม....”",
    content: `
กระต่ายลืมตาช้า ๆ
มองคุณนิ่งอยู่ครู่หนึ่ง ก่อนกระโดดหายเข้าไปในพุ่มไม้
แต่แทนที่จะหนี มัน...หันกลับมา เหมือนจะชวนคุณตาม
คุณลังเล แต่ก็ก้าวตามเข้าไป
จนพบ “ประตูไม้เก่า” ตั้งอยู่กลางป่า`,
  },

  //Quiz_5
  {
    id: "quiz_5",
    type: "quiz",
    image: "/images/quiz_5.png",
    title: "“หากเปิดบานนี้... คุณจะต้องทิ้งสิ่งหนึ่งไว้ข้างหลัง”",
    content: `สิ่งใดที่คุณพร้อมจะวางไว้ข้างหลัง?`,
    choices: [
      { id: "0ec4c9ef-63c5-4cec-9a59-a4f7f117d54b", text: "ความวุ่นวายที่ปกคลุมหัวใจ" },
      { id: "a5ce837d-9c97-406a-845b-82088acbddd1", text: "ความกลัวที่จะไม่เป็นที่ยอมรับ" },
      { id: "83872c34-8f96-4184-a9f6-6ad62add8894", text: "ข้อจำกัดเดิม ๆ ที่ฉุดความคิดสร้างสรรค์" },
      { id: "c3db160d-c821-45c5-8f53-01b93e49f980", text: "ความผูกพันกับอดีตที่เหนี่ยวรั้งใจ" },
    ],
  },

  //Quiz_6
  {
    id: "quiz_6",
    type: "quiz",
    title: `
เมื่อผลักประตูออก
กลิ่นหอมอ่อน ๆ ลอยมากับลม
ใต้ต้นไม้มีเคาน์เตอร์ไม้เล็ก ๆ
กระต่ายในผ้ากันเปื้อนสีขาว กำลังชงเครื่องดื่ม
บนโต๊ะ มีเครื่องดื่ม 4 แก้ว ข้าง ๆ มีป้ายไม้เขียนว่า:
“เหนื่อยมากไหม… ลองดื่มอะไรดูนะ”`,
    content: `เครื่องดื่มไหนที่คุณอยากยื่นมือไปหยิบ`,
    choices: [
      { id: "1132dd96-4905-4039-934d-819fdfd8f4fe", text: "มัทฉะลาเต้" },
      { id: "0939a4aa-c710-43fc-b3c6-8e95fe597416", text: "อเมริกาโน่ร้อน" },
      { id: "8d8267f6-3fbf-4dbc-af86-f6845bae91fd", text: "อัญชันมะนาวโซดา" },
      { id: "fb85fa73-3e38-49c0-ab49-edf152b1f02b", text: "โกโก้ร้อนเข้ม ๆ" },
    ],
  },

    //Quiz_7
  {
    id: "quiz_7",
    type: "quiz",
    content: `เสียงดนตรีเริ่มดังขึ้นอีกครั้ง...
    คุณรู้สึกอยากทำอะไรต่อ?`,
    choices: [
      { id: "4bf78451-b2c8-4e8d-af6f-f4c91045f061", text: "หยิบหนังสือมานั่งอ่าน ท่ามกลางแสงแดดอ่อน ๆ" },
      { id: "82aa687d-f2ce-4c23-b5db-bb5cf2c51012", text: "นั่งมองธรรมชาติพร้อมจิบน้ำเบา ๆ อย่างไม่รีบ" },
      { id: "a6c314d9-ce36-423c-b2fd-72f1911bbdd4", text: "หยิบกล่องสีมาวาดแก้วเครื่องดื่มตรงหน้า" },
      { id: "bd660740-3ffc-40c9-8bbb-ba6f0f114e23", text: "พับกระดาษเป็นรูปสัตว์ พร้อมข้อความถึงใครบางคน" },
    ],
  },
    //Quiz_8
  {
    id: "quiz_8",
    type: "quiz",
    content: `มีคนแปลกหน้าเดินผ่านมาด้านหลัง…
    ทำให้คุณ…`,
    choices: [
      { id: "5890de19-8082-4963-a4de-aa83aa067597", text: "รู้สึกอยากอยู่เงียบ ๆ มากกว่าเดิม" },
      { id: "ef6226dc-f914-437c-9c54-6adf0fa079ac", text: "อยากเดินไปทัก แล้วดูว่าเขาเป็นใคร" },
      { id: "5a7f4a25-7c99-454e-baa6-5ddc9cc605e9", text: "แอบสังเกตนิสัยเขาจากพฤติกรรมเล็ก" },
      { id: "0ce5a398-bd52-4477-b380-8bf541946092", text: "คิดถึงเพื่อนคนหนึ่งที่ไม่ได้เจอกันนาน" },
    ],
  },
    //Quiz_9
  {
    id: "quiz_9",
    type: "quiz",
    content: `จู่ ๆ ไฟในร้านกระพริบเบา ๆ
    แล้วเพลงก็เงียบลง... ความเงียบชั่วขณะ
    ทำให้คุณรู้สึกว่า...`,
    choices: [
      { id: "adfde857-8800-45f0-bda4-8ee4be603496", text: "ถึงเวลาฟังเสียงที่อยู่ลึกที่สุดในใจ" },
      { id: "9d6b6e6b-67d6-4f2b-8142-cc9c2fc6ab13", text: "เงียบแบบนี้... คล้ายตอนนั่งฟังลมหายใจของต้นไม้" },
      { id: "6b4d23d9-21b2-480d-acde-3f82ea54cc3e", text: "ความเงียบแบบนี้... คือจุดเริ่มต้นของบางอย่าง" },
      { id: "41a1d5a8-afee-4b97-94f2-c2014d40b45e", text: "เงียบจัง… อยากได้อ้อมกอดหนึ่งครั้งก่อนจากกัน" },
    ],
  },
  // 🧠 STORY 05:
  {
    id: "story_5",
    type: "story",
    image: "/images/story_5.png",
    content: `
แสงอ่อน ๆ ส่องผ่านเปลือกตา
เสียงเพลงจางลง เหลือแค่นาฬิกาปลุก
คุณค่อย ๆ ลืมตา...

“อะ — เช้าแล้วหรอ ?”

ห้องเดิม เตียงเดิม
แล้ว... ทั้งหมดนั้นคืออะไร?`,
  },

      //Quiz_10
  {
    id: "quiz_10",
    type: "quiz",
    content: `คุณรู้สึกยังไงกับความฝันที่เพิ่งจบลง?`,
    choices: [
      { id: "cd4b6dae-73f3-4a1f-8570-6d64f3860c52", text: "เหมือนได้หยุดเวลา และกลับมาเข้าใจตัวเองมากขึ้น" },
      { id: "d24dcc9f-7ff5-45df-891e-da6049afd0e3", text: "อบอุ่นอย่างประหลาด เหมือนได้พบธรรมชาติในใจ" },
      { id: "e7673c4d-fd1b-46b9-9fde-f9cd343e8240", text: "ความฝันนั้น… ทำให้บางอย่างในใจกล้ามากกว่าที่เคย" },
      { id: "466f0cbe-a1ed-48c3-b7be-26feda4e7584", text: "เป็นฝันที่น่ารักแบบไม่มีเหตุผล… อยากฝันอีกเลย" },
    ],
  },

    // 🧠 STORY 06:
  {
    id: "story_6",
    type: "story",
    image: "/images/story_6.png",
    content: `
จู่ ๆ เสียงแจ้งเตือนก็ดังขึ้นจากโทรศัพท์ข้างหมอน
หน้าจอสว่างขึ้น พร้อมข้อความหนึ่ง:
“Café Message”
คุณชะงักเล็กน้อย ความฝันเมื่อครู่…
หรือว่ามันไม่ใช่แค่ความฝัน?`,
  },
  
];
